[
 {
  "title": "Best Practices for Building the AI Development Platform in Government",
  "content": "By John P. Desmond, AI Trends Editor \nThe AI stack defined by Carnegie Mellon University is fundamental to the approach being taken by the US Army for its AI development platform efforts, according to Isaac Faber, Chief Data Scientist at the US Army AI Integration Center, speaking at the AI World Government event held in-person and virtually from Alexandria, Va., last week.  \nIsaac Faber, Chief Data Scientist, US Army AI Integration Center\n“If we want to move the Army from legacy systems through digital modernization, one of the biggest issues I have found is the difficulty in abstracting away the differences in applications,” he said. “The most important part of digital transformation is the middle layer, the platform that makes it easier to be on the cloud or on a local computer.” The desire is to be able to move your software platform to another platform, with the same ease with which a new smartphone carries over the user’s contacts and histories.  \nEthics cuts across all layers of the AI application stack, which positions the planning stage at the top, followed by decision support, modeling, machine learning, massive data management and the device layer or platform at the bottom.  \n“I am advocating that we think of the stack as a core infrastructure and a way for applications to be deployed and not to be siloed in our approach,” he said. “We need to create a development environment for a globally-distributed workforce.”   \nThe Army has been working on a Common Operating Environment Software (Coes) platform, first announced in 2017, a design for DOD work that is scalable, agile, modular, portable and open. “It is suitable for a broad range of AI projects,” Faber said. For executing the effort, “The devil is in the details,” he said.   \nThe Army is working with CMU and private companies on a prototype platform, including with Visimo of Coraopolis, Pa., which offers AI development services. Faber said he prefers to collaborate and coordinate with private industry rather than buying products off the shelf. “The problem with that is, you are stuck with the value you are being provided by that one vendor, which is usually not designed for the challenges of DOD networks,” he said.  \nArmy Trains a Range of Tech Teams in AI \nThe Army engages in AI workforce development efforts for several teams, including:  leadership, professionals with graduate degrees; technical staff, which is put through training to get certified; and AI users.   \nTech teams in the Army have different areas of focus include: general purpose software development, operational data science, deployment which includes analytics, and a machine learning operations team, such as a large team required to build a computer vision system. “As folks come through the workforce, they need a place to collaborate, build and share,” Faber said.   \nTypes of projects include diagnostic, which might be combining streams of historical data, predictive and prescriptive, which recommends a course of action based on a prediction. “At the far end is AI; you don’t start with that,” said Faber. The developer has to solve three problems: data engineering, the AI development platform, which he called “the green bubble,” and the deployment platform, which he called “the red bubble.”   \n“These are mutually exclusive and all interconnected. Those teams of different people need to programmatically coordinate. Usually a good project team will have people from each of those bubble areas,” he said. “If you have not done this yet, do not try to solve the green bubble problem. It makes no sense to pursue AI until you have an operational need.”   \nAsked by a participant which group is the most difficult to reach and train, Faber said without hesitation, “The hardest to reach are the executives. They need to learn what the value is to be provided by the AI ecosystem. The biggest challenge is how to communicate that value,” he said.   \nPanel Discusses AI Use Cases with the Most Potential  \nIn a panel on Foundations of Emerging AI, moderator Curt Savoie, program director, Global Smart Cities Strategies for IDC, the market research firm, asked what emerging AI use case has the most potential.  \nJean-Charles Lede, autonomy tech advisor for the US Air Force, Office of Scientific Research, said,” I would point to decision advantages at the edge, supporting pilots and operators, and decisions at the back, for mission and resource planning.”   \nKrista Kinnard, Chief of Emerging Technology for the Department of Labor\nKrista Kinnard, Chief of Emerging Technology for the Department of Labor, said, “Natural language processing is an opportunity to open the doors to AI in the Department of Labor,” she said. “Ultimately, we are dealing with data on people, programs, and organizations.”    \nSavoie asked what are the big risks and dangers the panelists see when implementing AI.   \nAnil Chaudhry, Director of Federal AI Implementations for the General Services Administration (GSA), said in a typical IT organization using traditional software development, the impact of a decision by a developer only goes so far. With AI, “You have to consider the impact on a whole class of people, constituents, and stakeholders. With a simple change in algorithms, you could be delaying benefits to millions of people or making incorrect inferences at scale. That’s the most important risk,” he said.  \nHe said he asks his contract partners to have “humans in the loop and humans on the loop.”   \nKinnard seconded this, saying, “We have no intention of removing humans from the loop. It’s really about empowering people to make better decisions.”   \nShe emphasized the importance of monitoring the AI models after they are deployed. “Models can drift as the data underlying the changes,” she said. “So you need a level of critical thinking to not only do the task, but to assess whether what the AI model is doing is acceptable.”   \nShe added, “We have built out use cases and partnerships across the government to make sure we’re implementing responsible AI. We will never replace people with algorithms.”  \nLede of the Air Force said, “We often have use cases where the data does not exist. We cannot explore 50 years of war data, so we use simulation. The risk is in teaching an algorithm that you have a ‘simulation to real gap’ that is a real risk. You are not sure how the algorithms will map to the real world.”  \nChaudhry emphasized the importance of a testing strategy for AI systems. He warned of developers “who get enamored with a tool and forget the purpose of the exercise.” He recommended the development manager design in independent verification and validation strategy. “Your testing, that is where you have to focus your energy as a leader. The leader needs an idea in mind, before committing resources, on how they will justify whether the investment was a success.”   \nLede of the Air Force talked about the importance of explainability. “I am a technologist. I don’t do laws. The ability for the AI function to explain in a way a human can interact with, is important. The AI is a partner that we have a dialogue with, instead of the AI coming up with a conclusion that we have no way of verifying,” he said.  \nLearn more at AI World Government. "
 },
 {
  "title": "Advance Trustworthy AI and ML, and Identify Best Practices for Scaling AI",
  "content": "By John P. Desmond, AI Trends Editor  \nAdvancing trustworthy AI and machine learning to mitigate agency risk is a priority for the US Department of Energy (DOE), and identifying best practices for implementing AI at scale is a priority for the US General Services Administration (GSA).  \nThat’s what attendees learned in two sessions at the AI World Government live and virtual event held in Alexandria, Va. last week.   \nPamela Isom, Director of the AI and Technology Office, DOE\nPamela Isom, Director of the AI and Technology Office at the DOE, who spoke on Advancing Trustworthy AI and ML Techniques for Mitigating Agency Risks, has been involved in proliferating the use of AI across the agency for several years. With an emphasis on applied AI and data science, she oversees risk mitigation policies and standards and has been involved with applying AI to save lives, fight fraud, and strengthen the cybersecurity infrastructure.  \nShe emphasized the need for the AI project effort to be part of a strategic portfolio. “My office is there to drive a holistic view on AI and to mitigate risk by bringing us together to address challenges,” she said. The effort is assisted by the DOE’s AI and Technology Office, which is focused on transforming the DOE into a world-leading AI enterprise by accelerating research, development, delivery and the adoption of AI.  \n“I am telling my organization to be mindful of the fact that you can have tons and tons of data, but it might not be representative,” she said. Her team looks at examples from international partners, industry, academia and other agencies for outcomes “we can trust” from systems incorporating AI.  \n“We know that AI is disruptive, in trying to do what humans do and do it better,” she said. “It is beyond human capability; it goes beyond data in spreadsheets; it can tell me what I’m going to do next before I contemplate it myself. It’s that powerful,” she said.  \nAs a result, close attention must be paid to data sources. “AI is vital to the economy and our national security. We need precision; we need algorithms we can trust; we need accuracy. We don’t need biases,” Isom said, adding, “And don’t forget that you need to monitor the output of the models long after they have been deployed.”   \nExecutive Orders Guide GSA AI Work \nExecutive Order 14028, a detailed set of actions to address the cybersecurity of government agencies, issued in May of this year, and Executive Order 13960, promoting the use of trustworthy AI in the Federal government, issued in December 2020, provide valuable guides to her work.   \nTo help manage the risk of AI development and deployment, Isom has produced the AI Risk Management Playbook, which provides guidance around system features and mitigation techniques. It also has a filter for ethical and trustworthy principles which are considered throughout AI lifecycle stages and risk types. Plus, the playbook ties to relevant Executive Orders.  \nAnd it provides examples, such as your results came in at 80% accuracy, but you wanted 90%. “Something is wrong there,” Isom said, adding, “The playbook helps you look at these types of problems and what you can do to mitigate risk, and what factors you should weigh as you design and build your project.”  \nWhile internal to DOE at present, the agency is looking into next steps for an external version. “We will share it with other federal agencies soon,” she said.   \nGSA Best Practices for Scaling AI Projects Outlined  \nAnil Chaudhry, Director of Federal AI Implementations, AI Center of Excellence (CoE), GSA\nAnil Chaudhry, Director of Federal AI Implementations for the AI Center of Excellence (CoE) of the GSA, who spoke on Best Practices for Implementing AI at Scale, has over 20 years of experience in technology delivery, operations and program management in the defense, intelligence and national security sectors.   \nThe mission of the CoE is to accelerate technology modernization across the government, improve the public experience and increase operational efficiency. “Our business model is to partner with industry subject matter experts to solve problems,” Chaudhry said, adding, “We are not in the business of recreating industry solutions and duplicating them.”   \nThe CoE is providing recommendations to partner agencies and working with them to implement AI systems as the federal government engages heavily in AI development. “For AI, the government landscape is vast. Every federal agency has some sort of AI project going on right now,” he said, and the maturity of AI experience varies widely across agencies.  \nTypical use cases he is seeing include having AI focus on increasing speed and efficiency, on cost savings and cost avoidance, on improved response time and increased quality and compliance. As one best practice, he recommended the agencies vet their commercial experience with the large datasets they will encounter in government.   \n“We’re talking petabytes and exabytes here, of structured and unstructured data,” Chaudhry said. [Ed. Note: A petabyte is 1,000 terabytes.] “Also ask industry partners about their strategies and processes on how they do macro and micro trend analysis, and what their experience has been in the deployment of bots such as in Robotic Process Automation, and how they demonstrate sustainability as a result of drift of data.”   \nHe also asks potential industry partners to describe the AI talent on their team or what talent they can access. If the company is weak on AI talent, Chaudhry would ask, “If you buy something, how will you know you got what you wanted when you have no way of evaluating it?”  \nHe added, “A best practice in implementing AI is defining how you train your workforce to leverage AI tools, techniques and practices, and to define how you grow and mature your workforce. Access to talent leads to either success or failure in AI projects, especially when it comes to scaling a pilot up to a fully deployed system.”  \nIn another best practice, Chaudhry recommended examining the industry partner’s access to financial capital. “AI is a field where the flow of capital is highly volatile. “You cannot predict or project that you will spend X amount of dollars this year to get where you want to be,” he said, because an AI development team may need to explore another hypothesis, or clean up some data that may not be transparent or is potentially biased. “If you don’t have access to funding, it is a risk your project will fail,” he said.  \nAnother best practice is access to logistical capital, such as the data  that sensors collect for an AI IoT system. “AI requires an enormous amount of data that is authoritative and timely. Direct access to that data is critical,” Chaudhry said. He recommended that data sharing agreements  be in place with organizations relevant to the AI system. “You might not need it right away, but having access to the data, so you could immediately use it and to have thought through the privacy issues before you need the data, is a good practice for scaling AI programs,” he said.   \nA final best practice is planning of physical infrastructure, such as data center space. “When you are in a pilot, you need to know how much capacity you need to reserve at your data center, and how many end points you need to manage” when the application scales up, Chaudhry said, adding, “This all ties back to access to capital and all the other best practices.“ \nLearn more at AI World Government. "
 },
 {
  "title": "Promise and Perils of Using AI for Hiring: Guard Against Data Bias",
  "content": "By AI Trends Staff  \nWhile AI in hiring is now widely used for writing job descriptions, screening candidates, and automating interviews, it poses a risk of wide discrimination if not implemented carefully. \nKeith Sonderling, Commissioner, US Equal Opportunity Commission\nThat was the message from Keith Sonderling, Commissioner with the US Equal Opportunity Commision, speaking at the AI World Government event held live and virtually in Alexandria, Va., last week. Sonderling is responsible for enforcing federal laws that prohibit discrimination against job applicants because of race, color, religion, sex, national origin, age or disability.   \n“The thought that AI would become mainstream in HR departments was closer to science fiction two year ago, but the pandemic has accelerated the rate at which AI is being used by employers,” he said. “Virtual recruiting is now here to stay.”  \nIt’s a busy time for HR professionals. “The great resignation is leading to the great rehiring, and AI will play a role in that like we have not seen before,” Sonderling said.  \nAI has been employed for years in hiring—“It did not happen overnight.”—for tasks including chatting with applications, predicting whether a candidate would take the job, projecting what type of employee they would be and mapping out upskilling and reskilling opportunities. “In short, AI is now making all the decisions once made by HR personnel,” which he did not characterize as good or bad.   \n“Carefully designed and properly used, AI has the potential to make the workplace more fair,” Sonderling said. “But carelessly implemented, AI could discriminate on a scale we have never seen before by an HR professional.”  \nTraining Datasets for AI Models Used for Hiring Need to Reflect Diversity  \nThis is because AI models rely on training data. If the company’s current workforce is used as the basis for training, “It will replicate the status quo. If it’s one gender or one race primarily, it will replicate that,” he said. Conversely, AI can help mitigate risks of hiring bias by race, ethnic background, or disability status. “I want to see AI improve on workplace discrimination,” he said.  \nAmazon began building a hiring application in 2014, and found over time that it discriminated against women in its recommendations, because the AI model was trained on a dataset of the company’s own hiring record for the previous 10 years, which was primarily of males. Amazon developers tried to correct it but ultimately scrapped the system in 2017.   \nFacebook has recently agreed to pay $14.25 million to settle civil claims by the US government that the social media company discriminated against American workers and violated federal recruitment rules, according to an account from Reuters. The case centered on Facebook’s use of what it called its PERM program for labor certification. The government found that Facebook refused to hire American workers for jobs that had been reserved for temporary visa holders under the PERM program.   \n“Excluding people from the hiring pool is a violation,” Sonderling said.  If the AI program “withholds the existence of the job opportunity to that class, so they cannot exercise their rights, or if it downgrades a protected class, it is within our domain,” he said.   \nEmployment assessments, which became more common after World War II, have provided  high value to HR managers and with help from AI they have the potential to minimize bias in hiring. “At the same time, they are vulnerable to claims of discrimination, so employers need to be careful and cannot take a hands-off approach,” Sonderling said. “Inaccurate data will amplify bias in decision-making. Employers must be vigilant against discriminatory outcomes.”  \nHe recommended researching solutions from vendors who vet data for risks of bias on the basis of race, sex, and other factors.   \nOne example is from HireVue of South Jordan, Utah, which has built a hiring platform predicated on the US Equal Opportunity Commission’s Uniform Guidelines, designed specifically to mitigate unfair hiring practices, according to an account from allWork.   \nA post on AI ethical principles on its website states in part, “Because HireVue uses AI technology in our products, we actively work to prevent the introduction or propagation of bias against any group or individual. We will continue to carefully review the datasets we use in our work and ensure that they are as accurate and diverse as possible. We also continue to advance our abilities to monitor, detect, and mitigate bias. We strive to build teams from diverse backgrounds with diverse knowledge, experiences, and perspectives to best represent the people our systems serve.”  \nAlso, “Our data scientists and IO psychologists build HireVue Assessment algorithms in a way that removes data from consideration by the algorithm that contributes to adverse impact without significantly impacting the assessment’s predictive accuracy. The result is a highly valid, bias-mitigated assessment that helps to enhance human decision making while actively promoting diversity and equal opportunity regardless of gender, ethnicity, age, or disability status.”  \nDr. Ed Ikeguchi, CEO, AiCure\nThe issue of bias in datasets used to train AI models is not confined to hiring. Dr. Ed Ikeguchi, CEO of AiCure, an AI analytics company working in the life sciences industry, stated in a recent account in HealthcareITNews, “AI is only as strong as the data it’s fed, and lately that data backbone’s credibility is being increasingly called into question. Today’s AI developers lack access to large, diverse data sets on which to train and validate new tools.”  \nHe added, “They often need to leverage open-source datasets, but many of these were trained using computer programmer volunteers, which is a predominantly white population. Because algorithms are often trained on single-origin data samples with limited diversity, when applied in real-world scenarios to a broader population of different races, genders, ages, and more, tech that appeared highly accurate in research may prove unreliable.” \nAlso, “There needs to be an element of governance and peer review for all algorithms, as even the most solid and tested algorithm is bound to have unexpected results arise. An algorithm is never done learning—it must be constantly developed and fed more data to improve.” \nAnd, “As an industry, we need to become more skeptical of AI’s conclusions and encourage transparency in the industry. Companies should readily answer basic questions, such as ‘How was the algorithm trained? On what basis did it draw this conclusion?” \nRead the source articles and information at AI World Government, from Reuters and from HealthcareITNews. "
 },
 {
  "title": "Predictive Maintenance Proving Out as Successful AI Use Case",
  "content": "By John P. Desmond, AI Trends Editor  \nMore companies are successfully exploiting predictive maintenance systems that combine AI and IoT sensors to collect data that anticipates breakdowns and recommends preventive action before break or machines fail, in a demonstration of an AI use case with proven value.  \nThis growth is reflected in optimistic market forecasts. The predictive maintenance market is sized at $6.9 billion today and is projected to grow to $28.2 billion by 2026, according to a report from IoT Analytics of Hamburg, Germany. The firm counts over 280 vendors offering solutions in the market today, projected to grow to over 500 by 2026.  \nFernando Bruegge, Analyst, IoT Analytics, Hamburg, Germany\n“This research is a wake-up call to those that claim IoT is failing,” stated analyst Fernando Bruegge, author of the report, adding, “For companies that own industrial assets or sell equipment, now is the time to invest in predictive maintenance-type solutions.” And, “Enterprise technology firms need to prepare to integrate predictive maintenance solutions into their offerings,” Bruegge suggested.  \nHere is a review of some specific experience with predictive maintenance systems that combine AI and IoT sensors. \nAircraft engine manufacturer Rolls-Royce is deploying predictive analytics to help reduce the amount of carbon its engines produce, while also optimizing maintenance to help customers keep planes in the air longer, according to a recent account in CIO. \nRolls-Royce built an Intelligent Engine platform to monitor engine flight, gathering data on weather conditions and how pilots are flying. Machine learning is applied to the data to customize maintenance regimes for individual engines. \nStuart Hughes, chief information and digital officer, Rolls-Royce\n“We’re tailoring our maintenance regimes to make sure that we’re optimizing for the life an engine has, not the life the manual says it should have,” stated Stuart Hughes, chief information and digital officer at Rolls-Royce. “It’s truly variable service, looking at each engine as an individual engine.” \nCustomers are seeing less service interruption. “Rolls-Royce has been monitoring engines and charging per hour for at least 20 years,” Hughes stated. “That part of the business isn’t new. But as we’ve evolved, we’ve begun to treat the engine as a singular engine. It’s much more about the personalization of that engine.”  \nPredictive analytics is being applied in healthcare as well as in the manufacturing industry. Kaiser Permanente, the integrated managed care consortium based in Oakland, Calif. Is using predictive analytics to identify non-intensive care unit (ICU) patients at risk of rapid deterioration.   \nWhile non-ICU patients that require unexpected transfers to the ICU constitute less than 4% of the total hospital population, they account for 20% of all hospital deaths, according to Dr. Gabriel Escobar, research scientist, Division of Research, and regional director, Hospital Operations Research, Kaiser Permanente Northern California. \nKaiser Permanente Practicing Predictive Maintenance in Healthcare \nKaiser Permanente developed the Advanced Alert Monitor (AAM) system, leveraging three predictive analytic models to analyze more than 70 factors in a given patient’s electronic health record to generate a composite risk score. \n“The AAM system synthesizes and analyzes vital statistics, lab results, and other variables to generate hourly deterioration risk scores for adult hospital patients in the medical-surgical and transitional care units,” stated Dick Daniels, executive vice president and CIO of Kaiser Permanente in the CIO account. “Remote hospital teams evaluate the risk scores every hour and notify rapid response teams in the hospital when potential deterioration is detected. The rapid response team conducts bedside evaluation of the patient and calibrates the course treatment with the hospitalist.” \nIn advice to other practitioners, Daniels recommended a focus on how the tool will be fit into the workflow of health care teams. “It took us about five years to perform the initial mapping of the electronic medical record backend and develop the predictive models,” Daniels stated. “It then took us another two to three years to transition these models into a live web services application that could be used operationally.” \nIn an example from the food industry, a PepsiCo Frito-Lay plant in Fayetteville, Tenn. is using predictive maintenance successfully, with year-to-date equipment downtime at 0.75% and unplanned downtime at 2.88%, according to Carlos Calloway, the site’s reliability engineering manager, in an account in PlantServices. \nExamples of monitoring include: vibration readings confirmed by ultrasound helped to prevent a PC combustion blower motor from failing and shutting down the whole potato chip department; infrared analysis of the main pole for the plant’s GES automated warehouse detected a hot fuse holder, which helped to avoid a shutdown of the entire warehouse; and increased acid levels were detected in oil samples from a baked extruder gearbox, indicating oil degradation, which enabled prevention of a shutdown of Cheetos Puffs production. \nThe Frito-Lay plant produces more than 150 million pounds of product per year, including Lays, Ruffles, Cheetos, Doritos, Fritos, and Tostitos.  \nThe types of monitoring include vibration analysis, used on mechanical applications, which is processed with the help of a third-party company which sends alerts to the plant for investigation and resolution. Another service partner performs quarterly vibration monitoring on selected equipment. All motor control center rooms and electrical panels are monitored with quarterly infrared analysis, which is also used on electrical equipment, some rotating equipment, and heat exchangers. In addition, the plant has done ultrasonic monitoring for more than 15 years, and it is “kind of like the pride and joy of our site from a predictive standpoint,” stated Calloway.  \nThe plan has a number of products in place from UE Systems of Elmsford, NY, supplier of ultrasonic instruments, hardware and software, and training for predictive maintenance.   \nLouisiana Alumina Plant Automating Bearing Maintenance   \nBearings, which wear over time under varying conditions of weather and temperature in the case of automobiles, are a leading candidate for IoT monitoring and predictive maintenance with AI. The Noranda Alumina plant in Gramercy, La. is finding a big payoff from its investment in a system to improve the lubrication of bearings in its production equipment.  \nThe system has resulted in a 60% decline in bearing changes in the second year of using the new lubrication system, translating to some $900,000 in savings on bearings that did not need to be replaced and avoided downtime.  \n“Four hours of downtime is about $1 million dollars’ worth of lost production,” stated Russell Goodwin, a reliability engineer and millwright instructor at Noranda Alumina, in the PlantServices account, which was based on presentations at the Leading Reliability 2021 event. \nThe Noranda Alumina plant is the only alumina plant operating in the US. “If we shut down, you’ll need to import it,” stated Goodwin. The plant experiences pervasive dust, dirt, and caustic substances, which complicate efforts at improved reliability and maintenance practices.  \nNoranda Alumina tracks all motors and gearboxes at 1,500 rpm and higher with vibration readings, and most below 1,500 with ultrasound. Ultrasonic monitoring, of sound in ranges beyond human hearing, was introduced to the plant after Goodwin joined the company in 2019. At the time, grease monitoring had room for improvement. “If grease was not visibly coming out of the seal, the mechanical supervisor did not count the round as complete,” stated Goodwin.  \nAfter introducing automation, the greasing system has improved dramatically, he stated. The system was also able to detect bearings in a belt whose bearings were wearing out too quickly due to contamination. “Tool-enabled tracking helped to prove that it wasn’t improper greasing, but rather the bearing was made improperly,” stated Goodwin.  \nRead the source articles and information in  IoT Analytics, in CIO and in PlantServices. "
 },
 {
  "title": "Novelty In The Game Of Go Provides Bright Insights For AI And Autonomous Vehicles",
  "content": "By Lance Eliot, the AI Trends Insider  \nWe already expect that humans to exhibit flashes of brilliance. It might not happen all the time, but the act itself is welcomed and not altogether disturbing when it occurs.   \nWhat about when Artificial Intelligence (AI) seems to display an act of novelty? Any such instance is bound to get our attention; questions arise right away.   \nHow did the AI come up with the apparent out-of-the-blue insight or novel indication? Was it a mistake, or did it fit within the parameters of what the AI was expected to produce? There is also the immediate consideration of whether the AI somehow is slipping toward the precipice of becoming sentient.   \nPlease be aware that no AI system in existence is anywhere close to reaching sentience, despite the claims and falsehoods tossed around in the media. As such, if today’s AI seems to do something that appears to be a novel act, you should not leap to the conclusion that this is a sign of human insight within technology or the emergence of human ingenuity among AI.   \nThat’s an anthropomorphic bridge too far.   \nThe reality is that any such AI “insightful” novelties are based on various concrete computational algorithms and tangible data-based pattern matching.   \nIn today’s column, we’ll be taking a close look at an example of an AI-powered novel act, illustrated via the game of Go, and relate these facets to the advent of AI-based true self-driving cars as a means of understanding the AI-versus-human related ramifications. \nRealize that the capacity to spot or suggest a novelty is being done methodically by an AI system, while, in contrast, no one can say for sure how humans can devise novel thoughts or intuitions. \nPerhaps we too are bound by some internal mechanistic-like facets, or maybe there is something else going on. Someday, hopefully, we will crack open the secret inner workings of the mind and finally know how we think. I suppose it might undercut the mystery and magical aura that oftentimes goes along with those of us that have moments of outside-the-box visions, though I’d trade that enigma to know how the cups-and-balls trickery truly functions (going behind the curtain, as it were).   \nSpeaking of novelty, a famous game match involving the playing of Go can provide useful illumination on this overall topic.   \nGo is a popular board game in the same complexity category as chess. Arguments are made about which is tougher, chess or Go, but I’m not going to get mired into that morass. For the sake of civil discussion, the key point is that Go is highly complex and requires intense mental concentration especially at the tournament level.   \nGenerally, Go consists of trying to capture territory on a standard Go board, consisting of a 19 by 19 grid of intersecting lines. For those of you that have never tried playing Go, the closest similar kind of game might be the connect-the-dots that you played in childhood, which involves grabbing up territory, though Go is magnitudes more involved.    \nThere is no need for you to know anything in particular about Go to get the gist of what will be discussed next regarding the act of human novelty and the act of AI novelty.   \nA famous Go competition took place about four years ago that pitted one of the world’s top professional Go players, Lee Sedol, against an AI program that had been crafted to play Go, coined as AlphaGo. There is a riveting documentary about the contest and plenty of write-ups and online videos that have in detail covered the match, including post-game analysis.   \nPut yourself back in time to 2016 and relive what happened. \nMost AI developers did not anticipate that the AI of that time would be proficient enough to beat a top Go player. Sure, AI had already been able to best some top chess players, and thus offered a glimmer of expectation that Go would eventually be equally undertaken, but there weren’t any Go programs that had been able to compete at the pinnacle levels of human Go players. Most expected that it would probably be around the year 2020 or so before the capabilities of AI would be sufficient to compete in world-class Go tournaments.  \nDeepMind Created AlphaGo Using Deep Learning, Machine Learning   \nA small-sized tech company named DeepMind Technologies devised the AlphaGo AI playing system (the firm was later acquired by Google). Using techniques from Machine Learning and Deep Learning, the AlphaGo program was being revamped and adjusted right up to the actual tournament, a typical kind of last-ditch developer contortions that many of us have done when trying to get the last bit of added edge into something that is about to be demonstrated.   \nThis was a monumental competition that had garnered global interest.   \nHuman players of Go were doubtful that the AlphaGo program would win. Many AI techies were doubtful that AlphaGo would win. Even the AlphaGo developers were unsure of how well the program would do, including the stay-awake-at-night fears that the AlphaGo program would hit a bug or go into a kind of delusional mode and make outright mistakes and play foolishly.   \nA million dollars in prize money was put into the pot for the competition. There would be five Go games played, one per day, along with associated rules about taking breaks, etc. Some predicted that Sedol would handily win all five games, doing so without cracking a sweat. AI pundits were clinging to the hope that AlphaGo would win at least one of the five games, and otherwise, present itself as a respectable level of Go player throughout the contest. \nIn the first match, AlphaGo won.   \nThis was pretty much a worldwide shocker. Sedol was taken aback. Lots of Go players were surprised that a computer program could compete and beat someone at Sedol’s level of play. Everyone began to give some street cred to the AlphaGo program and the efforts by the AI developers.   \nTension grew for the next match.   \nFor the second game, it was anticipated that Sedol might significantly change his approach to the contest. Perhaps he had been overconfident coming into the competition, some harshly asserted, and the loss of the first game would awaken him to the importance of putting all his concentration into the tournament. Or, possibly he had played as though he was competing with a lesser capable player and thus was not pulling out all the stops to try and win the match.   \nWhat happened in the second game? \nTurns out that AlphaGo prevailed, again, and also did something that was seemingly remarkable for those that avidly play Go. On the 37th move of the match, the AlphaGo program opted to make placement onto the Go board in a spot that nobody especially anticipated. It was a surprise move, coming partway through a match that otherwise was relatively conventional in the nature of the moves being made by both Sedol and AlphaGo.   \nAt the time, in real-time, rampant speculation was that the move was an utter gaffe on the part of the AlphaGo program.   \nInstead, it became famous as a novel move, known now as “Move 37” and heralded in Go and used colloquially overall to suggest any instance when AI does something of a novel or unexpected manner.   \nIn the third match, AlphaGo won again, now having successfully beaten Sedol in a 3-out-of-5 winner competition. They continued though to play a fourth and a fifth game.   \nDuring the fourth game, things were tight as usual and the match play was going head-to-head (well, head versus AI). Put yourself into the shoes of Sedol. In one sense, he wasn’t just a Go player, he was somehow representing all of humanity (an unfair and misguided viewpoint, but pervasive anyway), and the pressure was on him to win at least one game. Just even one game would be something to hang your hat on, and bolster faith in mankind (again, a nonsensical way to look at it).   \nAt the seventy-eighth move of the fourth game, Sedol made a so-called “wedge” play that was not conventional and surprised onlookers. The next move by AlphaGo was rotten and diminished the likelihood of a win by the AI system. After additional play, ultimately AlphaGo tossed in the towel and resigned from the match, thus Sedol finally had a win against the AI in his belt. He ended-up losing the fifth game, so AlphaGo won four games, Sedol won one). His move also became famous, generally known as “Move 78” in the lore of Go playing. \nSomething else that is worthwhile to know about involves the overarching strategy that AlphaGo was crafted to utilize.   \nWhen you play a game, let’s say connect-the-dots, you can aim to grab as many squares at each moment of play, doing so under the belief that inevitably you will then win by the accumulation of those tactically-oriented successes. Human players of Go are often apt to play that way, as it can be said too of chess players, and nearly any kind of game playing altogether.   \nAnother approach involves playing to win, even if only by the thinnest of margins, as long as you win. In that case, you might not be motivated for each tactical move to gain near-term territory or score immediate points, and be willing instead to play a larger scope game per se. The proverbial mantra is that if you are shortsighted, you might win some of the battles, but could eventually lose the war. Therefore, it might be a better strategy to keep your eye on the prize, winning the war, albeit if it means that there are battles and skirmishes to be lost along the way.   \nThe AI developers devised AlphaGo with that kind of macro-perspective underlying how the AI system functioned.   \nHumans can have an especially hard time choosing at the moment to make a move that might look bad or ill-advised, such as giving up territory, finding themselves to be unable to grit their teeth, and taking a lump or two during play. The embarrassment at the instant is difficult to offset by betting that it is going to ultimately be okay, and you will prevail in the end.   \nFor an AI system, there is no semblance of that kind of sentiment involved, and it is all about calculated odds and probabilities.   \nNow that we’ve covered the legendary Go match, let’s consider some lessons learned about novelty.   \nThe “Move 38” made by the AI system was not magical. It was an interesting move, for sure, and the AI developers later indicated that the move was one that the AI had calculated would rarely be undertaken by a human player.   \nThis can be interpreted in two ways (at least).   \nOne interpretation is that a human player would not make that move because humans are right and know that it would be a lousy move.   \nAnother interpretation is that humans would not make that move due to a belief that the move is unwise, but this could be a result of the humans insufficiently assessing the ultimate value of the move, in the long-run, and getting caught up in a shorter time frame semblance of play. \nIn this instance, it turned out to be a good move—maybe a brilliant move—and turned the course of the game to the advantage of the AI. Thus, what looked like brilliance was in fact a calculated move that few humans would have imagined as valuable and for which jostled humans to rethink how they think about such matters.   \nSome useful recap lessons:   \nShowcasing Human Self-Limited Insight. When the AI does something seemingly novel, it might be viewed as novel simply because humans have already predetermined what is customary and anything beyond that is blunted by the assumption that it is unworthy or mistaken. You could say that we are mentally trapped by our own drawing of the lines of what is considered as inside versus outside the box.   \nHumans Exploiting AI For Added Insight. Humans can gainfully assess an AI-powered novelty to potentially re-calibrate human thinking on a given topic, enlarging our understanding via leveraging something that the AI, via its vast calculative capacity, might detect or spot that we have not yet so ascertained. Thus, besides admiring the novelty, we ought to seek to improve our mental prowess by whatever source shines brightly including an AI system.   \nAI Novelty Is A Dual-Edged Sword. We need to be mindful of all AI systems and their possibility of acting in a novel way, which could be good or could be bad. In the Go game, it worked out well. In other circumstances, the AI exploiting the novelty route might go off the tracks, as it were.   \nLet’s see how this can be made tangible via exploring the advent of AI-based true self-driving cars.   \nFor my framework about AI autonomous cars, see the link here: https://aitrends.com/ai-insider/framework-ai-self-driving-driverless-cars-big-picture/   \nWhy this is a moonshot effort, see my explanation here: https://aitrends.com/ai-insider/self-driving-car-mother-ai-projects-moonshot/   \nFor more about the levels as a type of Richter scale, see my discussion here: https://aitrends.com/ai-insider/richter-scale-levels-self-driving-cars/   \nFor the argument about bifurcating the levels, see my explanation here: https://aitrends.com/ai-insider/reframing-ai-levels-for-self-driving-cars-bifurcation-of-autonomy/   \nUnderstanding The Levels Of Self-Driving Cars \nAs a clarification, true self-driving cars are ones where the AI drives the car entirely on its own and there isn’t any human assistance during the driving task. \nThese driverless vehicles are considered a Level 4 and Level 5, while a car that requires a human driver to co-share the driving effort is usually considered at a Level 2 or Level 3. The cars that co-share the driving task are described as being semi-autonomous, and typically contain a variety of automated add-on’s that are referred to as ADAS (Advanced Driver-Assistance Systems).   \nThere is not yet a true self-driving car at Level 5, which we don’t yet even know if this will be possible to achieve, and nor how long it will take to get there.   \nMeanwhile, the Level 4 efforts are gradually trying to get some traction by undergoing very narrow and selective public roadway trials, though there is controversy over whether this testing should be allowed per se (we are all life-or-death guinea pigs in an experiment taking place on our highways and byways, some contend).   \nFor why remote piloting or operating of self-driving cars is generally eschewed, see my explanation here: https://aitrends.com/ai-insider/remote-piloting-is-a-self-driving-car-crutch/   \nTo be wary of fake news about self-driving cars, see my tips here: https://aitrends.com/ai-insider/ai-fake-news-about-self-driving-cars/ \nThe ethical implications of AI driving systems are significant, see my indication here: http://aitrends.com/selfdrivingcars/ethically-ambiguous-self-driving-cars/   \nBe aware of the pitfalls of normalization of deviance when it comes to self-driving cars, here’s my call to arms: https://aitrends.com/ai-insider/normalization-of-deviance-endangers-ai-self-driving-cars/ \nSelf-Driving Cars And Acts Of Novelty   \nFor Level 4 and Level 5 true self-driving vehicles, there won’t be a human driver involved in the driving task. All occupants will be passengers; the AI is doing the driving.   \nYou could say that the AI is playing a game, a driving game, requiring tactical decision-making and strategic planning, akin to when playing Go or chess, though in this case involving life-or-death matters driving a multi-ton car on our public roadways.   \nOur base assumption is that the AI driving system is going to always take a tried-and-true approach to any driving decisions. This assumption is somewhat shaped around a notion that AI is a type of robot or automata that is bereft of any human biases or human foibles.   \nIn reality, there is no reason to make this kind of assumption. Yes, we can generally rule out the aspect that the AI is not going to display the emotion of a human ilk, and we also know that the AI will not be drunk or DUI in its driving efforts. Nonetheless, if the AI has been trained using Machine Learning (ML) and Deep Learning (DL), it can pick up subtleties of human behavioral patterns in the data about human driving, out of which it will likewise utilize or mimic in choosing its driving actions (for example, see my column postings involving an analysis of potential racial biases in AI and the possibility of gender biases).   \nTurning back to the topic of novelty, let’s ponder a specific use case.   \nA few years ago, I was driving on an open highway, going at the prevailing speed of around 65 miles per hour, and something nearly unimaginable occurred. A car coming toward me in the opposing lane, and likely traveling at around 60 to 70 miles per hour, suddenly and unexpectedly veered into my lane. It was one of those moments that you cannot anticipate.   \nThere did not appear to be any reason for the other driver to be headed toward me, in my lane of traffic, and coming at me for an imminent and bone-chillingly terrifying head-on collision. If there had been debris on the other lane, it might have been a clue that perhaps this other driver was simply trying to swing around the obstruction. No debris. If there was a slower moving car, the driver might have wanted to do a fast end-around to get past it. Nope, there was absolutely no discernible basis for this radical and life-threatening maneuver. \nWhat would you do? \nCome on, hurry, the clock is ticking, and you have just a handful of split seconds to make a life-or-death driving decision.   \nYou could stay in your lane and hope that the other driver realizes the error of their ways, opting to veer back into their lane at the last moment. Or, you could proactively go into the opposing lane, giving the other driver a clear path in your lane, but this could be a chancy game of chicken whereby the other driver chooses to go back into their lane (plus, there was other traffic further behind that driver, so going into the opposing lane was quite dicey).   \nOkay, so do you stay in your lane or veer away into the opposing lane?   \nI dare say that most people would be torn between those two options. Neither one is palatable. \nSuppose the AI of a self-driving car was faced with the same circumstance.   \nWhat would the AI do?   \nThe odds are that even if the AI had been fed with thousands upon thousands of miles of driving via a database about human driving while undergoing the ML/DL training, there might not be any instances of a head-to-head nature and thus no prior pattern to utilize for making this onerous decision.   \nAnyway, here’s a twist.   \nImagine that the AI calculated the probabilities involving which way to go, and in some computational manner came to the conclusion that the self-driving car should go into the ditch that was at the right of the roadway. This was intended to avoid entirely a collision with the other car (the AI estimated that a head-on collision would be near-certain death for the occupants). The AI estimated that going into the ditch at such high speed would indisputably wreck the car and cause great bodily injury to the occupants, but the odds of assured death were (let’s say) calculated as lower than the head-on option possibilities (this is a variant of the infamous Trolley Problem, as covered in my columns).   \nI’m betting that you would concede that most humans would be relatively unwilling to aim purposely into that ditch, which they know for sure is going to be a wreck and potential death, while instead willing (reluctantly) to take a hoped-for chance of either veering into the other lane or staying on course and wishing for the best.   \nIn some sense, the AI might seem to have made a novel choice. It is one that (we’ll assume) few humans would have given any explicit thought toward.   \nReturning to the earlier recap of the points about AI novelty, you could suggest that in this example, the AI has exceeded a human self-imposed limitation by the AI having considered otherwise “unthinkable” options. From this, perhaps we can learn to broaden our view for options that otherwise don’t seem apparent.   \nThe other recap element was that the AI novelty can be a dual-edged sword.   \nIf the AI did react by driving into the ditch, and you were inside the self-driving car, and you got badly injured, would you later believe that the AI acted in a novel manner or that it acted mistakenly or adversely?   \nSome might say that if you lived to ask that question, apparently the AI made the right choice. The counter-argument is that if the AI had gone with one of the other choices, perhaps you would have sailed right past the other car and not gotten a single scratch.   \nFor more details about ODDs, see my indication at this link here: https://www.aitrends.com/ai-insider/amalgamating-of-operational-design-domains-odds-for-ai-self-driving-cars/ \nOn the topic of off-road self-driving cars, here’s my details elicitation: https://www.aitrends.com/ai-insider/off-roading-as-a-challenging-use-case-for-ai-autonomous-cars/ \nI’ve urged that there must be a Chief Safety Officer at self-driving car makers, here’s the scoop: https://www.aitrends.com/ai-insider/chief-safety-officers-needed-in-ai-the-case-of-ai-self-driving-cars/ \nExpect that lawsuits are going to gradually become a significant part of the self-driving car industry, see my explanatory details here: http://aitrends.com/selfdrivingcars/self-driving-car-lawsuits-bonanza-ahead/ \nConclusion   \nFor those of you wondering what actually did happen, my lucky stars were looking over me that day, and I survived with nothing more than a close call. I decided to remain in my lane, though it was tempting to veer into the opposing lane, and by some miracle, the other driver suddenly went back into the opposing lane.   \nWhen I tell the story, my heart still gets pumping, and I begin to sweat.   \nOverall, AI that appears to engage in novel approaches to problems can be advantageous and in some circumstances such as playing a board game can be right or wrong, for which being wrong does not especially put human lives at stake.   \nFor AI-based true self-driving cars, lives are at stake.   \nWe’ll need to proceed mindfully and with our eyes wide open about how we want AI driving systems to operate, including calculating odds and deriving choices while at the wheel of the vehicle.  \nCopyright 2021 Dr. Lance Eliot  \nhttp://ai-selfdriving-cars.libsyn.com/website "
 },
 {
  "title": "Getting Government AI Engineers to Tune into AI Ethics Seen as Challenge",
  "content": "By John P. Desmond, AI Trends Editor  \nEngineers tend to see things in unambiguous terms, which some may call Black and White terms, such as a choice between right or wrong and good and bad. The consideration of ethics in AI is highly nuanced, with vast gray areas, making it  challenging for AI software engineers to apply it in their work.  \nThat was a takeaway from a session on the Future of Standards and Ethical AI at the AI World Government conference held in-person and virtually in Alexandria, Va. this week.   \nAn overall impression from the conference is that the discussion of AI and ethics is happening in virtually every quarter of AI in the vast enterprise of the federal government, and the consistency of points being made across all these different and independent efforts stood out.  \nBeth-Ann Schuelke-Leech, associate professor, engineering management, University of Windsor\n“We engineers often think of ethics as a fuzzy thing that no one has really explained,” stated Beth-Anne Schuelke-Leech, an associate professor, Engineering Management and Entrepreneurship at the University of Windsor, Ontario, Canada, speaking at the Future of Ethical AI session. “It can be difficult for engineers looking for solid constraints to be told to be ethical. That becomes really complicated because we don’t know what it really means.”  \nSchuelke-Leech started her career as an engineer, then decided to pursue a PhD in public policy, a background which enables her to see things as an engineer and as a social scientist. “I got a PhD in social science, and have been pulled back into the engineering world where I am involved in AI projects, but based in a mechanical engineering faculty,” she said.   \nAn engineering project has a goal, which describes the purpose, a set of needed features and functions, and a set of constraints, such as budget and timeline “The standards and regulations become part of the constraints,” she said. “If I know I have to comply with it, I will do that. But if you tell me it’s a good thing to do, I may or may not adopt that.”  \nSchuelke-Leech also serves as chair of the IEEE Society’s Committee on the Social Implications of Technology Standards. She commented, “Voluntary compliance standards such as from the IEEE are essential from people in the industry getting together to say this is what we think we should do as an industry.”  \nSome standards, such as around interoperability, do not have the force of law but engineers comply with them, so their systems will work. Other standards are described as good practices, but are not required to be followed. “Whether it helps me to achieve my goal or hinders me getting to the objective, is how the engineer looks at it,” she said.   \nThe Pursuit of AI Ethics Described as “Messy and Difficult”  \nSara Jordan, senior counsel, Future of Privacy Forum\nSara Jordan, senior counsel with the Future of Privacy Forum, in the session with Schuelke-Leech, works on the ethical challenges of AI and machine learning and is an active member of the IEEE Global Initiative on Ethics and Autonomous and Intelligent Systems. “Ethics is messy and difficult, and is context-laden. We have a proliferation of theories, frameworks and constructs,” she said, adding, “The practice of ethical AI will require repeatable, rigorous thinking in context.”  \nSchuelke-Leech offered, “Ethics is not an end outcome. It is the process being followed. But I’m also looking for someone to tell me what I need to do to do my job, to tell me how to be ethical, what rules I’m supposed to follow, to take away the ambiguity.”  \n“Engineers shut down when you get into funny words that they don’t understand, like ‘ontological,’ They’ve been taking math and science since they were 13-years-old,” she said.  \nShe has found it difficult to get engineers involved in attempts to draft standards for ethical AI. “Engineers are missing from the table,” she said. “The debates about whether we can get to 100% ethical are conversations engineers do not have.”  \nShe concluded, “If their managers tell them to figure it out, they will do so. We need to help the engineers cross the bridge halfway. It is essential that social scientists and engineers don’t give up on this.”  \nLeader’s Panel Described Integration of Ethics into AI Development Practices  \nThe topic of ethics in AI is coming up more in the curriculum of the US Naval War College of Newport, R.I., which was established to provide advanced study for US Navy officers and now educates leaders from all services. Ross Coffey, a military professor of National Security Affairs at the institution, participated in a Leader’s Panel on AI, Ethics and Smart Policy at AI World Government.  \n“The ethical literacy of students increases over time as they are working with these ethical issues, which is why it is an urgent matter because it will take a long time,” Coffey said.  \nPanel member Carole Smith, a senior research scientist with Carnegie Mellon University who studies human-machine interaction, has been involved in integrating ethics into AI systems development since 2015. She cited the importance of “demystifying” AI.    \n“My interest is in understanding what kind of interactions we can create where the human is appropriately trusting the system they are working with, not over- or under-trusting it,” she said, adding, “In general, people have higher expectations than they should for the systems.”  \nAs an example, she cited the Tesla Autopilot features, which implement self-driving car capability to a degree but not completely. “People assume the system can do a much broader set of activities than it was designed to do. Helping people understand the limitations of a system is important. Everyone needs to understand the expected outcomes of a system and what some of the mitigating circumstances might be,” she said.   \nPanel member Taka Ariga, the first chief data scientist appointed to the US Government Accountability Office and director of the GAO’s Innovation Lab, sees a gap in AI literacy for the young workforce coming into the federal government.  “Data scientist training does not always include ethics. Accountable AI is a laudable construct, but I’m not sure everyone buys into it. We need their responsibility to go beyond technical aspects and be accountable to the end user we are trying to serve,” he said.  \nPanel moderator Alison Brooks, PhD, research VP of Smart Cities and Communities at the IDC market research firm, asked whether principles of ethical AI can be shared across the boundaries of nations.   \n“We will have a limited ability for every nation to align on the same exact approach, but we will have to align in some ways on what we will not allow AI to do, and what people will also be responsible for,” stated Smith of CMU.   \nThe panelists credited the European Commission for being out front on these issues of ethics, especially in the enforcement realm. \nRoss of the Naval War Colleges acknowledged the importance of finding common ground around AI ethics. “From a military perspective, our interoperability needs to go to a whole new level. We need to find common ground with our partners and our allies on what we will allow AI to do and what we will not allow AI to do.” Unfortunately, “I don’t know if that discussion is happening,” he said.  \nDiscussion on AI ethics could perhaps be pursued as part of certain existing treaties, Smith suggested  \nThe many AI ethics principles, frameworks, and road maps being offered in many federal agencies can be challenging to follow and be made consistent. Take said, “I am hopeful that over the next year or two, we will see a coalescing.”  \nFor more information and access to recorded sessions, go to AI World Government. "
 },
 {
  "title": "Digital Natives Seen Having Advantages as Part of Government AI Engineering Teams",
  "content": "By John P. Desmond, AI Trends Editor  \nAI is more accessible to young people in the workforce who grew up as ‘digital natives’ with Alexa and self-driving cars as part of the landscape, giving them expectations grounded in their experience of what is possible.  \nThat idea set the foundation for a panel discussion at AI World Government on Mindset Needs and Skill Set Myths for AI engineering teams, held this week virtually and in-person in Alexandria, Va.  \nDorothy Aronson, CIO and Chief Data Officer, National Science Foundation\n“People feel that AI is within their grasp because the technology is available, but the technology is ahead of our cultural maturity,” said panel member Dorothy Aronson, CIO and Chief Data Officer for the National Science Foundation. “It’s like giving a sharp object to a child. We might have access to big data, but it might not be the right thing to do,” to work with it in all cases.   \nThings are accelerating, which is raising expectations. When panel member Vivek Rao, lecturer and researcher at the University of California at Berkeley, was working on his PhD, a paper on natural language processing might be a master’s thesis. “Now we assign it as a homework assignment with a two-day turnaround. We have an enormous amount of compute power that was not available even two years ago,” he said of his students, who he described as “digital natives” with high expectations of what AI makes possible.  \nRachel Dzombak, digital transformation lead, Software Engineering Institute, Carnegie Mellon University\nPanel moderator Rachel Dzombak, digital transformation lead at the Software Engineering Institute of Carnegie Mellon University, asked the panelists what is unique about working on AI in the government.   \nAronson said the government cannot get too far ahead with the technology, or the users will not know how to interact with it. “We’re not building iPhones,” she said. “We have experimentation going on, and we are always looking ahead, anticipating the future, so we can make the most cost-effective decisions. In the government right now, we are seeing the convergence of the emerging generation and the close-to-retiring generation, who we also have to serve.”   \nEarly in her career, Aronson did not want to work in the government. “I thought it meant you were either in the armed services or the Peace Corps,” she said. “But what I learned after a while is what motivates federal employees is service to larger, problem-solving institutions. We are trying to solve really big problems of equity and diversity, and getting food to people and keeping people safe. People that work for the government are dedicated to those missions.”   \nShe referred to her two children in their 20s, who like the idea of service, but in “tiny chunks,” meaning, “They don’t look at the government as a place where they have freedom, and they can do whatever they want. They see it as a lockdown situation. But it’s really not.”   \nBerkeley Students Learn About Role of Government in Disaster Response  \nRao of Berkeley said his students are seeing wildfires in California and asking who is working on the challenge of doing something about them. When he tells them it is almost always local, state and federal government entities, “Students are generally surprised to find that out.”   \nIn one example, he developed a course on innovation in disaster response, in collaboration with CMU and the Department of Defense, the Army Futures Lab and Coast Guard search and rescue. “This was eye-opening for students,” he said. At the outset, two of 35 students expressed interest in a federal government career. By the end of the course, 10 of the 35 students were expressing interest. One of them was hired by the Naval Surface Warfare Center outside Corona, Calif. as a software engineer, Rao said.  \nAronson described the process of bringing on new federal employees as a “heavy lift,” suggesting, “if we could prepare in advance, it would move a lot faster.” \nBryan Lane, director of Data & AI, General Services Administration\nAsked by Dzombak what skill sets and mindsets are seen as essential to AI engineering teams, panel member Bryan Lane, director of Data & AI at the General Services Administration (who announced during the session that he is taking on a new role at FDIC), said resiliency is a necessary quality.  \nLane is a technology executive within the GSA IT Modernization Centers of Excellence (CoE) with over 15 years of experience leading advanced analytics and technology initiatives. He has led the GSA partnership with the DoD Joint Artificial Intelligence Center (JAIC). [Ed. Note: Known as “the Jake.”] Lane also is the founder of DATA XD. He also has experience in industry, managing acquisition portfolios.   \n“The most important thing about resilient teams going on an AI journey is that you need to be ready for the unexpected, and the mission persists,” he said. “If you are all aligned on the importance of the mission, the team can be held together.”  \nGood Sign that Team Members Acknowledge Having “Never Done This Before”  \nRegarding mindset, he said more of his team members are coming to him and saying, “I’ve never done this before.” He sees that as a good sign that offers an opportunity to talk about risk and alternative solutions. “When your team has the psychological safety to say that they don’t know something,” Lane sees it as positive. “The focus is always on what you have done and what you have delivered. Rarely is the focus on what you have not done before and what you want to grow into,” he said,  \nAronson has found it challenging to get AI projects off the ground. “It’s hard to tell management that you have a use case or problem to solve and want to go at it, and there is a 50-50 chance it will get done, and you don’t know how much it’s going to cost,” she said. “It comes down to articulating the rationale and convincing others it’s the right thing to do to move forward.”  \nRao said he talks to students about experimentation and having an experimental mindset. “AI tools can be easily accessible, but they can mask the challenges you can encounter. When you apply the vision API, for example in the context of challenges in your business or government agency, things may not be smooth,” he said.  \nModerator Dzombak asked the panelists how they build teams. Arson said, “You need a mix of people.” She has tried “communities of practice” around solving specific problems, where people can come and go. “You bring people together around a problem and not a tool,” she said.  \nLane seconded this. “I really have stopped focusing on tools in general,” he said. He ran experiments at JAIC in accounting, finance and other areas. “We found it’s not really about the tools. It’s about getting the right people together to understand the problems, then looking at the tools available,” he said.  \nLane said he sets up “cross-functional teams” that are “a little more formal than a community of interest.” He has found them to be effective for working together on a problem for maybe 45 days. He also likes working with customers of the needed services inside the organization, and has seen customers learn about data management and AI as a result. “We will pick up one or two along the way who become advocates for accelerating AI throughout the organization,” Lane said.  \nLane sees it taking five years to work out proven methods of thinking, working, and best practices for developing AI systems to serve the government. He mentioned The Opportunity Project (TOP) of the US Census Bureau, begun in 2016 to work on challenges such as ocean plastic pollution, COVID-19 economic recovery and disaster response. TOP has engaged in over 135 public-facing projects in that time, and has over 1,300 alumni including developers, designers, community leaders, data and policy experts, students and government agencies.   \n“It’s based on a way of thinking and how to organize work,” Lane said. “We have to scale the model of delivery, but five years from now, we will have enough proof of concept to know what works and what does not.” \nLearn more at AI World Government, at the Software Engineering Institute, at DATA XD and at The Opportunity Project. "
 },
 {
  "title": "How Accountability Practices Are Pursued by AI Engineers in the Federal Government",
  "content": "By John P. Desmond, AI Trends Editor   \nTwo experiences of how AI developers within the federal government are pursuing AI accountability practices were outlined at the AI World Government event held virtually and in-person this week in Alexandria, Va. \nTaka Ariga, chief data scientist and director, US Government Accountability Office\nTaka Ariga, chief data scientist and director at the US Government Accountability Office, described an AI accountability framework he uses within his agency and plans to make available to others.  \nAnd Bryce Goodman, chief strategist for AI and machine learning at the Defense Innovation Unit (DIU), a unit of the Department of Defense founded to help the US military make faster use of emerging commercial technologies, described work in his unit to apply principles of AI development to terminology that an engineer can apply.  \nAriga, the first chief data scientist appointed to the US Government Accountability Office and director of the GAO’s Innovation Lab, discussed an AI Accountability Framework he helped to develop by convening a forum of experts in the government, industry, nonprofits, as well as federal inspector general officials and AI experts.   \n“We are adopting an auditor’s perspective on the AI accountability framework,” Ariga said. “GAO is in the business of verification.”  \nThe effort to produce a formal framework began in September 2020 and included 60% women, 40% of whom were underrepresented minorities, to discuss over two days. The effort was spurred by a desire to ground the AI accountability framework in the reality of an engineer’s day-to-day work. The resulting framework was first published in June as what Ariga described as “version 1.0.”  \nSeeking to Bring a “High-Altitude Posture” Down to Earth  \n“We found the AI accountability framework had a very high-altitude posture,” Ariga said. “These are laudable ideals and aspirations, but what do they mean to the day-to-day AI practitioner? There is a gap, while we see AI proliferating across the government.”  \n“We landed on a lifecycle approach,” which steps through stages of design, development, deployment and continuous monitoring. The development effort stands on four “pillars” of Governance, Data, Monitoring and Performance.  \nGovernance reviews what the organization has put in place to oversee the AI efforts. “The chief AI officer might be in place, but what does it mean? Can the person make changes? Is it multidisciplinary?”  At a system level within this pillar, the team will review individual AI models to see if they were “purposely deliberated.”  \nFor the Data pillar, his team will examine how the training data was evaluated, how representative it is, and is it functioning as intended.  \nFor the Performance pillar, the team will consider the “societal impact” the AI system will have in deployment, including whether it risks a violation of the Civil Rights Act. “Auditors have a long-standing track record of evaluating equity. We grounded the evaluation of AI to a proven system,” Ariga said.   \nEmphasizing the importance of continuous monitoring, he said, “AI is not a technology you deploy and forget.” he said. “We are preparing to continually monitor for model drift and the fragility of algorithms, and we are scaling the AI appropriately.” The evaluations will determine whether the AI system continues to meet the need “or whether a sunset is more appropriate,” Ariga said.  \nHe is part of the discussion with NIST on an overall government AI accountability framework. “We don’t want an ecosystem of confusion,” Ariga said. “We want a whole-government approach. We feel that this is a useful first step in pushing high-level ideas down to an altitude meaningful to the practitioners of AI.”  \nDIU Assesses Whether Proposed Projects Meet Ethical AI Guidelines  \nBryce Goodman, chief strategist for AI and machine learning, the Defense Innovation Unit\nAt the DIU, Goodman is involved in a similar effort to develop guidelines for developers of AI projects within the government.   \nProjects Goodman has been involved with implementation of AI for humanitarian assistance and disaster response, predictive maintenance, to counter-disinformation, and predictive health. He heads the Responsible AI Working Group. He is a faculty member of Singularity University, has a wide range of consulting clients from inside and outside the government, and holds a PhD in AI and Philosophy from the University of Oxford.  \nThe DOD in February 2020 adopted five areas of Ethical Principles for AI after 15 months of consulting with AI experts in commercial industry, government academia and the American public.  These areas are: Responsible, Equitable, Traceable, Reliable and Governable.   \n“Those are well-conceived, but it’s not obvious to an engineer how to translate them into a specific project requirement,” Good said in a presentation on Responsible AI Guidelines at the AI World Government event. “That’s the gap we are trying to fill.” \nBefore the DIU even considers a project, they run through the ethical principles to see if it passes muster. Not all projects do. “There needs to be an option to say the technology is not there or the problem is not compatible with AI,” he said.   \nAll project stakeholders, including from commercial vendors and within the government, need to be able to test and validate and go beyond minimum legal requirements to meet the principles. “The law is not moving as fast as AI, which is why these principles are important,” he said.  \nAlso, collaboration is going on across the government to ensure values are being preserved and maintained. “Our intention with these guidelines is not to try to achieve perfection, but to avoid catastrophic consequences,” Goodman said. “It can be difficult to get a group to agree on what the best outcome is, but it’s easier to get the group to agree on what the worst-case outcome is.”  \nThe DIU guidelines along with case studies and supplemental materials will be published on the DIU website “soon,” Goodman said, to help others leverage the experience.  \nHere are Questions DIU Asks Before Development Starts  \nThe first step in the guidelines is to define the task.  “That’s the single most important question,” he said. “Only if there is an advantage, should you use AI.” \nNext is a benchmark, which needs to be set up front to know if the project has delivered.   \nNext, he evaluates ownership of the candidate data. “Data is critical to the AI system and is the place where a lot of problems can exist.” Goodman said. “We need a certain contract on who owns the data. If ambiguous, this can lead to problems.”  \nNext, Goodman’s team wants a sample of data to evaluate. Then, they need to know how and why the information was collected. “If consent was given for one purpose, we cannot use it for another purpose without re-obtaining consent,” he said.  \nNext, the team asks if the responsible stakeholders are identified, such as pilots who could be affected if a component fails.   \nNext, the responsible mission-holders must be identified. “We need a single individual for this,” Goodman said. “Often we have a tradeoff between the performance of an algorithm and its explainability. We might have to decide between the two. Those kinds of decisions have an ethical component and an operational component. So we need to have someone who is accountable for those decisions, which is consistent with the chain of command in the DOD.”   \nFinally, the DIU team requires a process for rolling back if things go wrong. “We need to be cautious about abandoning the previous system,” he said.   \nOnce all these questions are answered in a satisfactory way, the team moves on to the development phase.  \nIn lessons learned, Goodman said, “Metrics are key. And simply measuring accuracy might not be adequate. We need to be able to measure success.” \nAlso, fit the technology to the task. “High risk applications require low-risk technology. And when potential harm is significant, we need to have high confidence in the technology,” he said.  \nAnother lesson learned is to set expectations with commercial vendors. “We need vendors to be transparent,” he said. ”When someone says they have a proprietary algorithm they cannot tell us about, we are very wary. We view the relationship as a collaboration. It’s the only way we can ensure that the AI is developed responsibly.”  \nLastly, “AI is not magic. It will not solve everything. It should only be used when necessary and only when we can prove it will provide an advantage.”  \nLearn more at AI World Government, at the Government Accountability Office, at the AI Accountability Framework and at the Defense Innovation Unit site. "
 },
 {
  "title": "Startup: AssemblyAI Represents New Generation Speech Recognition",
  "content": "By AI Trends Staff  \nAdvances in the AI behind speech recognition are driving growth in the market, attracting venture capital and funding startups, posing challenges to established players.  \nThe growing acceptance and use of speech recognition devices are driving the market, which according to an estimate by Meticulous Research is expected to reach $26.8 billion globally by 2025, according to a recent account in Analytics Insight. Better speed and accuracy are among the benefits of the evolving technology. \nDylan Fox, CEO and Founder, AssemblyAI\nOne company in the throes of this new growth, AssemblyAI of San Francisco, is offering an API for speech recognition capable of transcribing videos, podcasts, phone calls, and remote meetings. The company was founded by CEO Dylan Fox in 2017 and has received backing from Y Combinator, a startup accelerator, as well as NVIDIA.   \nFox has an unusual background for a high tech entrepreneur. He is a graduate of George Washington University with a degree in business administration, business economics, and public policy. He got a job as a software engineer for machine learning in the emerging product lab of Cisco in San Francisco, working on deep neural networks and machine learning. He got the idea for AssemblyAi and attracted capital from Y Combinator, which enabled him to hire data scientists and data engineers to get the technology off the ground.   \nAsked in an interview with AI Trends how he made this transition from undergrad in business administration and economics to high-tech entrepreneur, Fox said, “I taught myself how to program, which led me to a path of machine learning. I was looking for a harder software challenge, which led to natural language processing, which took me to Cisco.” They were working on Siri for the Enterprise for Apple at the time, \nTo speed up the work, Cisco was looking to acquire speech recognition software; Fox was in the catbird’s seat for the search. “We looked at Nuance,” for example, acknowledged as a market leader and owner of more speech recognition software than its competitors. (The acquisition of Nuance by Microsoft for $19.6 billion is expected to be finalized by year-end.) The young, budding entrepreneur was not impressed. “It was crazy how bad all the options were from an accuracy and a developer point of view,” he stated.  \nHe was impressed by Twilio, a San Francisco-based company founded in 2008, which that year released the Twilio Voice API to make and receive phone calls hosted in the cloud. The company has since raised $103 million in venture capital. “They were setting new standards for a good API for developers,” Fox said.  \nFox’s idea was to use AI and machine learning to achieve “super accurate results, and make it easy for developers to incorporate the API into their products. One customer is CallRail, offering call tracking and marketing analytics software, which plans to incorporate AssembyAI’s API to gain insight into why people are calling. Other customers include NBC and the Wall Street Journal, using the product to transcribe content and interviews, and provide closed captioning.  \n“We’ve been working on building as close to human speech recognition quality as possible. It’s been a lot of work” Fox said. He expects to reach that plateau in 2022.  \nHe targets companies incorporating speech recognition into their products and makes it easy to buy. Customers pay on a usage basis; for every second of audio transcribed, AssemblyAI charges a fraction of a penny. Clients get billed monthly. If a customer uses 10 hours a month, it costs about nine dollars. If a customer uses a million hours a month, it costs about $900,000.    \nVoice recognition is a hot market. “Many new startups are being launched,” Fox said, providing opportunity. “Many interesting new businesses are being built on voice data.”   \nAssemblyAI’s product can detect sensitive topics such as hate speech and profanity, so customers can save on human content moderation. \nAsked to describe what differentiates his technology, Fox said, “We are an experienced team of deep learning researchers,” with experience from companies including BMW, Apple, and Facebook. “We build very large, very accurate deep learning models that have recognition results far more accurate than a traditional machine learning approach. We build really large models using advanced neural network technologies.” He compared the approach to what OpenAI uses to develop its GPT-3 large language model.  \nIn addition, they build AI features on top of the transcriptions, to provide summaries of audio and video content, which can be searched and indexed. “It goes beyond just transcription,” Fox said.   \nThe company currently has 25 employees and expects to double in about four months. Business has been good. “There is an explosion of audio and video data online and customers want to be able to take advantage of it, so we see a lot of demand,” Fox said. \nLearn more at AssemblyAI. "
 },
 {
  "title": "Pursuit of Autonomous Cars May Pose Risk of AI Tapping Forbidden Knowledge",
  "content": "By Lance Eliot, the AI Trends Insider    \nAre there things that we must not know?   \nThis is an age-old question. Some assert that there is the potential for knowledge that ought to not be known. In other words, there are ideas, concepts, or mental formulations that should we become aware of that knowledge it could be our downfall. The discovery or invention of some new innovation or way of thinking could be unduly dangerous. It would be best to not go there, as it were, and avoid ever landing on such knowledge: forbidden knowledge.   \nThe typical basis for wanting to forbid the discovery or emergence of forbidden knowledge is that the adverse consequences are overwhelming. The end result is so devastating and undercutting that the bad side outweighs the good that could be derived from the knowledge.   \nIt is conceivable that there might be knowledge that is so bad that it has no good possibilities at all. Thus, rather than trying to balance or weigh the good versus the bad, the knowledge has no counterbalancing effects. It is just plain bad.    \nWe are usually faced with the matter of knowledge that has both the good and the bad as to how it might be utilized or employed. This then leads to a dogged debate about whether the bad is so bad that it outweighs the good. On top of this, there is the unrealized bad and the unrealized good, which could be differentiated from the realized bad and the realized good (in essence, the knowledge might be said to be either good or bad, though this is purely conceptual and not put into real-world conditions to attest or become realized as such).   \nThe most familiar reference to forbidden knowledge is likely evoked via the Garden of Eden and the essence of forbidden fruit. \nA contemporary down-to-earth example often discussed about forbidden knowledge consists of the atomic bomb. Some suggest that the knowledge devised or invented to ultimately produce a nuclear bomb provides a quite visible and overt exemplar of the problems associated with knowledge. Had the knowledge about being able to attain an atomic bomb never been achieved, there presumably would not be any such device. In debates about the topic, it is feasible to take a resolute position favoring the attainment of an atomic bomb and there are equally counterbalancing contentions sternly disfavoring this attainment.   \nOne perplexing problem about forbidden knowledge encompasses knowing beforehand the kind of knowledge that might end up in the forbidden category. This is a bit of a Catch-22 or circular type of puzzle. You might discover knowledge and then ascertain it ought to be forbidden, but the cat is kind of out of the bag due to the knowledge having been already uncovered or rendered. Oopsie, you should have in advance decided to not go there and therefore have avoided falling into the forbidden knowledge zone.   \nOn a related twist, suppose that we could beforehand declare what type of knowledge is to be averted because it is predetermined as forbidden. Some people might accidentally discover the knowledge, doing so by happenstance, and now they’ve again potentially opened Pandora’s box. Meanwhile, there might be others that, regardless of being instructed to not derive any such stated forbidden knowledge, do so anyway.   \nThis then takes us to a frequently used retort about forbidden knowledge, namely, if you don’t seek the forbidden knowledge there is a chance that someone else will, and you’ll be left in the dust because they got there first. In that preemptive viewpoint, the claim is that it is better to go ahead and forage for the forbidden knowledge and not get caught behind the eight-ball when someone else beats you to the punch.   \nRound and round we can go.   \nThe main thing that most would agree to is that knowledge is power. \nThe alluded to power could be devastating and destroy others, possibly even leading to the self-destruction of the wielder of the knowledge. Yet there is also the potential for knowledge to be advantageous and save humanity from other ills.   \nMaybe we ought to say that knowledge is powerful. Despite that perhaps obvious proclamation, we might also add that knowledge can decay and gradually become outdated or less potent. Furthermore, since we are immersing ourselves herein into the cauldron of the love-it or hate-it knowledge conundrum, knowledge can be known and yet undervalued, perhaps only becoming valuable at a later time and in a different light.   \nThere is a case to be made that humankind has a seemingly irresistible allure toward more and more knowledge. Some philosophers suggest you are unlikely to be able to bottle up or stop this quest for knowledge. If that’s the manner of how humanity will be, this implies that you must find ways to control or contain knowledge and give up on the belief that we can altogether avoid landing into forbidden knowledge.   \nThere is a relatively new venue prompting a lot of anxious hand wringing pertaining to forbidden knowledge, namely the advent of Artificial Intelligence (AI).   \nHere’s the rub.   \nSuppose that we are able to craft AI systems that make use of knowledge about how humans can think. There are two major potential gotchas.   \nFirst, the AI systems themselves might end up doing good things, and they also might end up doing bad things. If the bad outweighs the good, maybe we are shooting our own foot by allowing AI to be put into use. \nSecondly, perhaps this could be averted entirely by deciding that there is forbidden knowledge about how humans think, and we ought to not discover or reveal those mental mechanisms. It is the classic stepwise logic that step A axiomatically leads to step B. We won’t need to worry about AI systems (step B), if we never allow the achievement of step A (figuring out how humans think and then imparting that into computers), since the attainment of AI would presumably not arise.   \nIn any case, there is inarguably a growing concern about AI.   \nPlenty of efforts are underway to promulgate a semblance of AI Ethics, meaning that those developers and indeed all stakeholders that are conceiving of, building, and putting into use an AI system needs to consider the ethical aspects of their efforts. AI systems have been unveiled and placed into use replete with all sorts of notable concerns, including incorporating unsavory biases and other problems.   \nAll told, one bold and somewhat stark argument is that the pursuit of AI is being underpinned or stoked by the discovery and then exploitation of forbidden knowledge.   \nBe aware that many would scoff at this allegation.   \nThere are those deeply immersed in the field of AI who would laugh that there is anything in the entirety of AI to date that constitutes potential forbidden knowledge. The technology and technological elements are relatively ho-hum, they would argue. You would be hard-pressed to pinpoint what AI-related knowledge that is already known comes anywhere near the ballpark of forbidden knowledge. \nFor those that concur with that posture, there is the reply that it might be future knowledge that we have not yet attained that is the upcoming forbidden kind, and for which we are heading pell-mell down that path. Thus, they would concede that we haven’t arrived at forbidden knowledge at this juncture, but this is an insidious distractor due to the aspect that it masks or belies our qualms entailing the possibility that it lays in wait at the next turn. \nOne area where AI is being actively used is to create Autonomous Vehicles (AVs). \nWe are gradually seeing the emergence of self-driving cars and can expect self-driving trucks, self-driving motorcycles, self-driving drones, self-driving planes, self-driving ships, self-driving submersibles, etc.   \nToday’s conventional cars are eventually going to give way to the advent of AI-based, true self-driving cars. Self-driving cars are driven via an AI driving system. There isn’t a need for a human driver at the wheel, and nor is there a provision for a human to drive the vehicle.   \nHere’s an intriguing question that has arisen: Might the crafting of AI-based true self-driving cars take us into the realm of discovering forbidden knowledge, and if so, what should be done about this?   \nBefore jumping into the details, I’d like to clarify what is meant when referring to true self-driving cars.   \nFor my framework about AI autonomous cars, see the link here: https://aitrends.com/ai-insider/framework-ai-self-driving-driverless-cars-big-picture/   \nWhy this is a moonshot effort, see my explanation here: https://aitrends.com/ai-insider/self-driving-car-mother-ai-projects-moonshot/   \nFor more about the levels as a type of Richter scale, see my discussion here: https://aitrends.com/ai-insider/richter-scale-levels-self-driving-cars/   \nFor the argument about bifurcating the levels, see my explanation here: https://aitrends.com/ai-insider/reframing-ai-levels-for-self-driving-cars-bifurcation-of-autonomy/   \nUnderstanding The Levels Of Self-Driving Cars   \nAs a clarification, true self-driving cars are ones where the AI drives the car entirely on its own and there isn’t any human assistance during the driving task.   \nThese driverless vehicles are considered Level 4 and Level 5, while a car that requires a human driver to co-share the driving effort is usually considered at Level 2 or Level 3. The cars that co-share the driving task are described as being semi-autonomous, and typically contain a variety of automated add-on’s that are referred to as ADAS (Advanced Driver-Assistance Systems). \nThere is not yet a true self-driving car at Level 5, which we don’t yet even know if this will be possible to achieve, and nor how long it will take to get there. \nMeanwhile, the Level 4 efforts are gradually trying to get some traction by undergoing very narrow and selective public roadway trials, though there is controversy over whether this testing should be allowed per se (we are all life-or-death guinea pigs in an experiment taking place on our highways and byways, some contend).   \nSince semi-autonomous cars require a human driver, the adoption of those types of cars won’t be markedly different from driving conventional vehicles, so there’s not much new per se to cover about them on this topic (though, as you’ll see in a moment, the points next made are generally applicable).  \nFor semi-autonomous cars, it is important that the public needs to be forewarned about a disturbing aspect that’s been arising lately, namely that despite those human drivers that keep posting videos of themselves falling asleep at the wheel of a Level 2 or Level 3 car, we all need to avoid being misled into believing that the driver can take away their attention from the driving task while driving a semi-autonomous car.   \nYou are the responsible party for the driving actions of the vehicle, regardless of how much automation might be tossed into a Level 2 or Level 3.   \nFor why remote piloting or operating of self-driving cars is generally eschewed, see my explanation here: https://aitrends.com/ai-insider/remote-piloting-is-a-self-driving-car-crutch/   \nTo be wary of fake news about self-driving cars, see my tips here: https://aitrends.com/ai-insider/ai-fake-news-about-self-driving-cars/ \nThe ethical implications of AI driving systems are significant, see my indication here: http://aitrends.com/selfdrivingcars/ethically-ambiguous-self-driving-cars/   \nBe aware of the pitfalls of normalization of deviance when it comes to self-driving cars, here’s my call to arms: https://aitrends.com/ai-insider/normalization-of-deviance-endangers-ai-self-driving-cars/   \nSelf-Driving Cars And Forbidden Knowledge   \nFor Level 4 and Level 5 true self-driving vehicles, there won’t be a human driver involved in the driving task.   \nAll occupants will be passengers.   \nThe AI is doing the driving.   \nOne aspect to immediately discuss entails the fact that the AI involved in today’s AI driving systems is not sentient. In other words, the AI is altogether a collective of computer-based programming and algorithms, and most assuredly not able to reason in the same manner that humans can.   \nWhy this added emphasis about the AI not being sentient?   \nBecause I want to underscore that when discussing the role of the AI driving system, I am not ascribing human qualities to the AI. Please be aware that there is an ongoing and dangerous tendency these days to anthropomorphize AI. In essence, people are assigning human-like sentience to today’s AI, despite the undeniable and inarguable fact that no such AI exists as yet. \nWith that clarification, you can envision that the AI driving system won’t natively somehow “know” about the facets of driving. Driving and all that it entails will need to be programmed as part of the hardware and software of the self-driving car.   \nLet’s dive into the myriad of aspects that come to play on this topic.   \nThe crux here is whether there is forbidden knowledge lurking within the existing and ongoing efforts to achieve AI-based true self-driving cars. We’ll begin by considering the status of the existent efforts and then shift into speculation about the future of such efforts.   \nPer the earlier discussion about whether there is forbidden knowledge that has already perchance been revealed or discovered via the efforts toward today’s AI systems all told, the odds seem stacked against such a notion at this time, and likewise the same could be said about the pursuit of self-driving cars. Essentially, there doesn’t seem to be any forbidden knowledge per se that has been discovered or revealed during the self-driving cars development journey so far, at least with respect to the conventional wisdom about what forbidden knowledge might entail.   \nOne could try to argue that it is premature to reach such a conclusion and that we might, later on, realize that forbidden knowledge was indeed uncovered or invented, and we just didn’t realize it. That is a rabbit hole that we’ll not go down for now, though you are welcome to keep that presumption at hand if so desired.   \nThat covers the present, and ergo we can turn our attention to the future.   \nGenerally, the efforts underway today have been primarily aimed at achieving Level 4, and the hope is that someday we will go beyond Level 4 and attain Level 5. To get to a robust Level 4, most would likely say that we can continue the existing approaches.   \nNot everyone would agree with that assumption. Some believe that we will get stymied within Level 4. Furthermore, the inability to produce a robust Level 4 will ostensibly preclude us from being able to attain Level 5. There is a contingent that suggests we need to start over and set aside the existing AI approaches, which otherwise are taking us down a dead-end or blind alley. An entirely new way of devising AI for autonomous vehicles is needed, they would vehemently argue.   \nThere is also a contingent that asserts the Level 4 itself is a type of dead-end. In brief, those proponents would say that we will achieve a robust Level 4, though this will do little good towards attaining Level 5. Once again, their view is similar to the preceding remark that we will need to come up with some radically new understandings about AI and the nature of cognitive acumen in order to get self-driving cars into the Level 5 realm.   \nAha, it is within that scope of having to dramatically revisit and revamp what AI is and how we can advance significantly in the pursuit of AI that the forbidden knowledge question can reside. In theory, perhaps the only means of attaining Level 5 will be to strike upon some knowledge that we do not yet know and that for which bodes for falling within the realm of forbidden knowledge. \nTo some, this seems farfetched. \nThey would emphatically ask; just what kind of knowledge are you even talking about?   \nHere’s their logic. Humans are able to drive cars. Humans do not seem to need or possess forbidden knowledge as it relates to the act of driving a car. Therefore, it seems ridiculous on the face of things to claim or contend that the only means to get AI-based true self-driving cars, for which they would be driven on an equal basis as human drivers can drive, would require the discovery or invention of whatever might be construed as forbidden knowledge.   \nSeems like pretty ironclad logic.   \nThe retort is that humans have common-sense reasoning. With common-sense reasoning, we seem to know all sorts of things about the world around us. When we drive a car, we intrinsically make use of our common-sense reasoning. We take for granted that we do have a common-sense reasoning capacity, and similarly, we take for granted that it integrally comes to the fore when driving a car.   \nAttempts to create AI that can exhibit the equivalent of human common-sense reasoning have made ostensibly modest or some would say minimal progress (to clarify, those pursuing this line of inquiry are to be lauded, it’s just that no earth-shattering breakthroughs seem to have been reached and none seem on the immediate horizon). Yes, there are some quite fascinating and exciting efforts underway, but when you measure those against the everyday common-sense reasoning of humans, there is no comparison. They are night and day. If this were a contest, the humans win hands down, no doubt about it, and the AI experimental efforts encompassing common-sense reasoning are mere playthings in contrast.   \nYou might have gleaned where this line of thought is headed.   \nThe belief by some is that until we crack open the enigma of common-sense reasoning, there is little chance of achieving a Level 5, and perhaps also this will hold back the Level 4 too. It could be that a secret ingredient of sorts for autonomous vehicles is the need to figure out and include common-sense reasoning into AI-based driving and piloting systems.   \nIf you buy into that logic, the added assertion is that maybe within the confines of how common-sense reasoning takes place is a semblance of forbidden knowledge. On the surface, you would certainly assume that if we knew entirely how common-sense reasoning works, there would not appear to be any cause for alarm or concern. The act of employing common-sense reasoning does not seem to necessarily embody forbidden knowledge.   \nThe twist is that perhaps the underlying cognitive means that gives rise to the advent of common-sense reasoning is where there is forbidden knowledge. Some deep-rooted elements in the nature of human thought and how we form common sense and undertake common-sense reasoning are possibly a type of knowledge that will be shown as crucial and a forbidden knowledge formulation.   \nFor more details about ODDs, see my indication at this link here: https://www.aitrends.com/ai-insider/amalgamating-of-operational-design-domains-odds-for-ai-self-driving-cars/ \nOn the topic of off-road self-driving cars, here’s my details elicitation: https://www.aitrends.com/ai-insider/off-roading-as-a-challenging-use-case-for-ai-autonomous-cars/ \nI’ve urged that there must be a Chief Safety Officer at self-driving car makers, here’s the scoop: https://www.aitrends.com/ai-insider/chief-safety-officers-needed-in-ai-the-case-of-ai-self-driving-cars/ \nExpect that lawsuits are going to gradually become a significant part of the self-driving car industry, see my explanatory details here: http://aitrends.com/selfdrivingcars/self-driving-car-lawsuits-bonanza-ahead/   \nConclusion   \nWow, that’s quite a bit of pondering, contemplation, and (some would say) wild thinking.   \nMaybe so, but it is a consideration that some would wish that we gave at least some credence toward and devoted attention to. There is the angst that we might find ourselves by happenstance stumbling into forbidden knowledge on these voracious self-driving cars quests.   \nFor however you might emphasize that having AI-based true self-driving cars will be a potential blessing, proffering mobility-for-all and leading to reducing the number of car crash-related fatalities, there is a sneaking suspicion that it will not be all-good. The catch or trap could be that there is some kind of forbidden knowledge that will get brought to the eye and we will inevitably kick ourselves that we didn’t see it coming.   \nThe next time you are munching on a delicious apple, give some thought to whether self-driving cars might be forbidden fruit.   \nWe are on the path to taking a big bite, and we’ll have to see where that takes us. \nCopyright 2021 Dr. Lance Eliot  \nhttp://ai-selfdriving-cars.libsyn.com/website "
 }
]